// Напишите программу, которая на вход
// принимает число и выдаёт его квадрат (число
// умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.Write("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine()); // -2 147 483 648 до 2 147 483 647
int square = number * number;
Console.Write($"Квадрат числа {number} = {square}");

if(number == 5) // если равно
{
    
}
if(number != 5) // если не равно
{
    
}

//ТАК ДЕЛАТЬ НЕ НУЖНО!!!!!
string s = "12345";
string res = s[1].ToString(); //2

// ТОЛЬКО ТАК!
// + - = / * %
// 5%3 = 2

// 123 % 10 = 3
// 456 % 10 = 6

// 456/10 = 45
// 456/100 = 4


